scratch/tmp/pytest-of-Micha/pytest-0/test_pipe_presets_air_flow_0/case/system/decomposeParDict
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object decomposeParDict;
}
numberOfSubdomains 4;
method scotch;
